export const commonHRQuestions = [
  {
    id: 1,
    question: 'Расскажите о самых сложных проблемах, над которыми вы работали. Как вы их решали?',
    answer:
      'Самые сложные задачи были связаны с библитеками. С их обновлениями, с ограничением их функционала, с их багами. Ag-grid, Vue drag and drop. В основном делал workaround (временное или обходное решение)',
  },
  {
    id: 2,
    question: 'Что вас мотивирует?',
    answer:
      'Во-первых, среда. Это когда процессы выстроены логично и прозрачно. Ну и люди вокруг, где ты можешь не только делиться опытом, но и постоянно учиться у более опытных коллег. Во-вторых, это прогресс. Меня мотивирует видеть, как растут мои скиллы. Твои усилия напрямую конвертируются в результат — личный и командный.',
  },
  {
    id: 3,
    question: 'С какими методологиями вы работали?',
    answer:
      'Kanban подход, Тим-лид в основном управлял потоками задач и приоритизировать их. Больше гибкости для MVP проекта.',
  },
  {
    id: 4,
    question: 'Опиши свое идеальное место работы?',
    answer: 'Работа с современным стеком, процессы и развитие в команде.',
  },
];
