export const browserAndCommonQuestions = [
  {
    id: 1,
    question: 'Мы ввели в URL строку и нажали Enter, что произойдет?',
    answer:
      'Браузер анализирует URL, разделяя его на протокол, домен, путь, параметры(query) и фрагмент(HashRouter - якорь ссылка). Если IP не закеширован — отправляется DNS-запрос(узнать цифровой  IP). Затем браузер устанавливает соединение с сервером по HTTP/HTTPS, отправляет HTTP-запрос и получает HTTP-ответ. После этого начинается рендер HTML, загрузка CSS, JS, изображений и других ресурсов. JavaScript выполняется в зависимости от атрибута скрипта. <script> без атрибутов — блокирует парсинг HTML. <script async> — выполняется как только загружен, независимо от готовности DOM. <script defer> — ждёт полного парсинга HTML',
  },
  {
    id: 2,
    question: 'Что такое HTTP и HTTPS?',
    answer:
      'HTTP (HyperText Transfer Protocol) — протокол передачи данных между клиентом и сервером. Текстовый, без шифрования — данные можно перехватить или подменить. HTTPS (HTTP Secure) — защищенная версия HTTP. Использует SSL/TLS(новее) (шифрование, данные нельзя изменить по пути, аутентификацию сервера) для шифрования данных между клиентом и сервером. Это защищает данные от перехвата, подмены и атак типа man-in-the-middle.',
  },
  {
    id: 3,
    question: 'Различия между HTTP 1.1 и HTTP 2, HTTP 3?',
    answer:
      'HTTP/1.1 — это текст по одной дороге, HTTP/2 — мультиплексированный бинарный поток, HTTP/3 — то же самое, но поверх UDP вместо TCP',
  },
  {
    id: 4,
    question: 'Как можно хранить информацию в браузере?',
    answer:
      'Cookie — до 4KB, автоматически отправляются на сервер. localStorage — около 5–10MB, хранится бессрочно. sessionStorage — хранится до закрытия вкладки. IndexedDB — встроенная браузерная база данных с поддержкой транзакций, индексов и хранения сложных структур данных.',
  },
  {
    id: 5,
    question: 'TCP и что такое трехстороннее рукопожатие?',
    answer:
      'TCP - протокол транспортного уровня(гарантирует, что информация дойдет 100%) three-way handshake состоит из 3 шагов: 1) Клиент отправляет SYN(Хочу соединиться, вот мой номер X). 2) Сервер отвечает SYN-ACK(Ок, вот мой номер Y, твой X принял). 3) Клиент отправляет ACK(Твой Y принял, работаем).',
  },
  {
    id: 6,
    question: 'Какие бывают виды веб-уязвимостей?',
    answer:
      'XSS (Cross-Site Scripting) — внедрение вредоносного JS-кода, защита через экранирование. CSRF — подделка запросов и бразуер может отправить куки на другой сайт, защита через CSRF-токены(передача csrfToken в свой запрос) и SameSite(strict). SSTI — внедрение шаблонного кода(шаблонизаторы для JS это Pug, Dust). RCE — удаленное выполнение кода на сервере.',
  },
  {
    id: 7,
    question: 'Что такое CORS?',
    answer:
      'Это механизм браузера, который контролирует кросс-доменные запросы. Чтобы разрешить, сервер должен вернуть заголовки: Access-Control-Allow-Origin (какие домены допущены), Access-Control-Allow-Methods (какие методы), Access-Control-Allow-Headers (какие заголовки).',
  },
  {
    id: 8,
    question: 'WebSocket и SSE (Server-Sent Events)?',
    answer:
      'Устанавливает постоянное двустороннее соединение. Начинается с HTTP-рукопожатия (заголовок Upgrade: websocket), затем обмен данными идёт в бинарном формате без накладных расходов HTTP. И клиент, и сервер могут отправить данные в любой момент. SSE - Односторонний поток от сервера к клиенту поверх обычного HTTP. Клиент открывает соединение, сервер шлёт данные через Content-Type: text/event-stream.',
  },
  {
    id: 10,
    question: 'Serve-worker',
    answer: `Это специальный фоновый скрипт, который браузер запускает отдельно от веб-страницы. Он управляет кэшем, перехватывает сетевые запросы и помогает сайтам работать без интернета. Service Worker может закешировать HTML, CSS и JS вашего приложения, чтобы при офлайне чат загружался и показывал старый диалог, а не ошибку.`,
  },
  {
    id: 11,
    question: 'S3 (Simple Storage Service)',
    answer: `Это облачное объектное хранилище. Если совсем просто: это безразмерный облачный жесткий диск, который доступен через интернет по HTTP, но вместо файловой системы с папками у него "корзины" (buckets) и ключи (уникальные идентификаторы файлов).`,
  },
  {
    id: 11,
    question: 'Оптимизация картинок',
    answer: `1) lazy loading.    
    2) WebP и AVIF.
    3) SVG для иконок.
    4) CDN и кеширование.
    5) Адаптивные изображения в зависимости от разрешения экрана.`,
  },
];
