export const htmlAndCssQuestions = [
  {
    id: 1,
    question: 'Модульный CSS',
    answer:
      'Подход, при котором стили компонента изолируются от глобального скоупа. Основные способы: CSS Modules (сборщик генерирует уникальные имена классов с хешем) и Scoped CSS во Vue (компилятор добавляет элементам data-атрибуты).',
  },
  {
    id: 2,
    question: 'Стадии reflow and repaint',
    answer: `Reflow (перекомпоновка) — это процесс пересчета геометрии элементов (размеров, позиций) и частичная или полная перестройка макета страницы. Это дорогая операция. Вызывается когда меняется ширина, высота, позиция элемента и любая вставка и удаление элементов.
      Repaint (перерисовка) — это процесс отрисовки внешнего вида элементов (цвета, тени, фон) без изменения их геометрии. Вызывается когда меняется цвет, тень, фон элемента и т.д.`,
  },
  {
    id: 3,
    question: 'Стадии отрисовки в браузере',
    answer: `1) Загрузка и парсинг HTML
    2) Загрузка и парсинг CSS (CSSOM)
    3) Render Tree и Layout - Для каждого видимого узла вычисляются - Точные размеры (ширина, высота) и координаты на экране (с учётом position, transform, margin и т.д.)
    4) Paint (отрисовка) - Браузер проходит по Render Tree и рисует пиксели для каждого узла
    5) Composite (композитинг)`,
  },
];
