export const reactQuestions = [
  {
    id: 1,
    question: 'Что такое JSX?',
    answer:
      'JSX - это расширение синтаксиса для JavaScript, которое позволяет вам писать HTML-подобный код прямо внутри JavaScript-файлов. React экранирует все значения, встроенные в JSX, перед тем как отрендерить их. Это означает, что невозможно внедрить XSS-атаки путем простой вставки пользовательского контента. Компилируется в вызовы React.createElement.',
  },
  {
    id: 2,
    question: 'Компоненты в React?',
    answer: `Классовые компоненты — это ES6-классы, которые расширяют React.Component и используют методы жизненного цикла, componentDidCatch() для ErrorBoundary. 
      Функциональные компоненты — это обычные JavaScript-функции, которые возвращают JSX.`,
  },
  {
    id: 3,
    question: 'Что такое props?',
    answer: `Props (properties) — это входные параметры, которые компонент получает от родительского компонента. Аналог аргументов функции. Props неизменяемы: компонент не должен их мутировать, иначе будет нарушено поведение React. Потеря оптимизаций — нарушение поверхностного сравнения.`,
  },
  {
    id: 4,
    question: 'Расскажи про ключи в React',
    answer: `Без ключей React перерисовывает весь список при любом изменении. С ключами React понимает, какой именно элемент изменился, и обновляет только его.Ключ можно задать любому компоненту. При смене ключа React УНИЧТОЖАЕТ старый экземпляр и СОЗДАЁТ новый. Это сбрасывает внутреннее состояние, refs, таймеры, useEffect — полный ремаунт`,
  },
  {
    id: 5,
    question: 'Расскажи про хуки',
    answer: `— useEffect — side-эффекты (запросы HTTP, подписки, таймеры, работа с DOM).
  Варианты массива зависимостей:
  • Без массива — эффект после каждого рендера.
  • [] — только при маунте (аналог componentDidMount).
  • [dep] — при изменении dep.
  • Функция очистки в return — аналог componentWillUnmount (отписки, clearInterval).
— useLayoutEffect — срабатывает синхронно после всех изменений в DOM и перед тем, как браузер выполнит перерисовку экрана. Нужен для измерений DOM, (размеры, позиция), когда результат измерения сразу влияет на отображение. Пример: измерили высоту блока и тут же установили её дочернему элементу — пользователь не увидит моргания, потому что всё применяется до отрисовки..
— useRef — Предназначен для сохранения и взаимодействия с изменяемыми значениями, которые не вызывают перерендеринг компонента. Хранение мутабельных значений: Вы можете использовать useRef для хранения переменных, которые не приводят к повторному рендерингу компонента. Часто используется для сохранения ссылок на DOM-элементы.
— useContext — подписка на контекст.`,
  },
  {
    id: 6,
    question: 'Кэширование в React',
    answer: `useMemo — мемоизация вычисляемого значения (тяжёлые вычисления, ссылочная стабильность).
    Reac.memo - это HOC который предотвращает повторный рендер компонента, если его пропсы не изменились.
    `,
  },
  {
    id: 7,
    question: '',
    answer: ``,
  },
];
